
ALL_REGION_CODES = [
    "01", "02", "03", "04", "05", "06", "07", "08", "09",
    "10", "11", "12", "13", "14", "15", "16", "17", "18", "19",
    "20", "21", "22", "23", "24", "25", "26", "27", "28", "29",
    "30", "31", "32", "33", "34", "35", "36", "37", "38", "39",
    "40", "41", "42", "43", "44", "45", "46", "47", "48", "49",
    "50", "51", "52", "53", "54", "55", "56", "57", "58", "59",
    "60", "61", "62", "63", "64", "65", "66", "67", "68", "69",
    "70", "71", "72", "73", "74", "75", "76", "77", "78", "79",
    "80", "81", "82", "83", "85", "86", "87", "89", "92", "95"
]

REGION_CODES_BY_FEDERAL_DISTRICT = {
    "Центральный федеральный округ": [
        "31",  # Белгородская область
        "32",  # Брянская область
        "33",  # Владимирская область
        "36",  # Воронежская область
        "37",  # Ивановская область
        "40",  # Калужская область
        "44",  # Костромская область
        "46",  # Курская область
        "48",  # Липецкая область
        "50",  # Московская область
        "57",  # Орловская область
        "62",  # Рязанская область
        "67",  # Смоленская область
        "68",  # Тамбовская область
        "69",  # Тверская область
        "71",  # Тульская область
        "76",  # Ярославская область
        "77",  # Москва
    ],

    "Северо-Западный федеральный округ": [
        "10",  # Республика Карелия
        "11",  # Республика Коми
        "29",  # Архангельская область
        "35",  # Вологодская область
        "39",  # Калининградская область
        "47",  # Ленинградская область
        "51",  # Мурманская область
        "53",  # Новгородская область
        "60",  # Псковская область
        "78",  # Санкт-Петербург
        "83",  # Ненецкий автономный округ
    ],

    "Южный федеральный округ": [
        "01",  # Республика Адыгея
        "08",  # Республика Калмыкия
        "23",  # Краснодарский край
        "30",  # Астраханская область
        "34",  # Волгоградская область
        "61",  # Ростовская область
        "82",  # Республика Крым
        "92",  # Севастополь
    ],

    "Северо-Кавказский федеральный округ": [
        "05",  # Республика Дагестан
        "06",  # Республика Ингушетия
        "07",  # Кабардино-Балкарская Республика
        "09",  # Карачаево-Черкесская Республика
        "15",  # Республика Северная Осетия — Алания
        "20",  # Чеченская Республика, старый код
        "26",  # Ставропольский край
        "95",  # Чеченская Республика
    ],

    "Приволжский федеральный округ": [
        "02",  # Республика Башкортостан
        "12",  # Республика Марий Эл
        "13",  # Республика Мордовия
        "16",  # Республика Татарстан
        "18",  # Удмуртская Республика
        "21",  # Чувашская Республика
        "43",  # Кировская область
        "52",  # Нижегородская область
        "56",  # Оренбургская область
        "58",  # Пензенская область
        "59",  # Пермский край
        "63",  # Самарская область
        "64",  # Саратовская область
        "73",  # Ульяновская область
        "81",  # бывший Коми-Пермяцкий АО, сейчас в составе Пермского края
    ],

    "Уральский федеральный округ": [
        "45",  # Курганская область
        "66",  # Свердловская область
        "72",  # Тюменская область
        "74",  # Челябинская область
        "86",  # Ханты-Мансийский автономный округ — Югра
        "89",  # Ямало-Ненецкий автономный округ
    ],

    "Сибирский федеральный округ": [
        "04",  # Республика Алтай
        "17",  # Республика Тыва
        "19",  # Республика Хакасия
        "22",  # Алтайский край
        "24",  # Красноярский край
        "38",  # Иркутская область
        "42",  # Кемеровская область — Кузбасс
        "54",  # Новосибирская область
        "55",  # Омская область
        "70",  # Томская область
        "85",  # бывший Усть-Ордынский Бурятский АО, сейчас в составе Иркутской области
    ],

    "Дальневосточный федеральный округ": [
        "03",  # Республика Бурятия
        "14",  # Республика Саха (Якутия)
        "25",  # Приморский край
        "27",  # Хабаровский край
        "28",  # Амурская область
        "41",  # Камчатский край
        "49",  # Магаданская область
        "65",  # Сахалинская область
        "75",  # Забайкальский край
        "79",  # Еврейская автономная область
        "80",  # бывший Агинский Бурятский АО, сейчас в составе Забайкальского края
        "87",  # Чукотский автономный округ
    ],
}


REGIONS_OF_THE_FILTERS = \
    {
      "Тендеры для Россетей": [
        "77",
        "12", "52", "43", "18", "33", "37", "62", "71", "40",
        "56", "63", "64",
        "36", "31", "57", "44", "76", "69", "67", "32", "46", "48", "68"
    ],
        "Тендеры для OEM": [
    "01", "02", "03", "04", "05", "06", "07", "08", "09",
    "10", "11", "12", "13", "14", "15", "16", "17", "18", "19",
    "20", "21", "22", "23", "24", "25", "26", "27", "28", "29",
    "30", "31", "32", "33", "34", "35", "36", "37", "38", "39",
    "40", "41", "42", "43", "44", "45", "46", "47", "48", "49",
    "50", "51", "52", "53", "54", "55", "56", "57", "58", "59",
    "60", "61", "62", "63", "64", "65", "66", "67", "68", "69",
    "70", "71", "72", "73", "74", "75", "76", "77", "78", "79",
    "80", "81", "82", "83", "85", "86", "87", "89", "92", "95"
    ],
        "Тендеры для ITM": [
    "01", "02", "03", "04", "05", "06", "07", "08", "09",
    "10", "11", "12", "13", "14", "15", "16", "17", "18", "19",
    "20", "21", "22", "23", "24", "25", "26", "27", "28", "29",
    "30", "31", "32", "33", "34", "35", "36", "37", "38", "39",
    "40", "41", "42", "43", "44", "45", "46", "47", "48", "49",
    "50", "51", "52", "53", "54", "55", "56", "57", "58", "59",
    "60", "61", "62", "63", "64", "65", "66", "67", "68", "69",
    "70", "71", "72", "73", "74", "75", "76", "77", "78", "79",
    "80", "81", "82", "83", "85", "86", "87", "89", "92", "95"
    ]
}